app/views/users/show.html.erb

SELECT "events".* FROM "events" INNER JOIN "responses" ON "events"."id" = "responses"."event_id" WHERE "responses"."user_id" = ?  [["user_id", 2]]
---
<ul>
  <% @user.events.each do |event| %>