app/views/events/show.html.erb

SELECT "users".* FROM "users" INNER JOIN "responses" ON "users"."id" = "responses"."user_id" WHERE "responses"."event_id" = ?  [["event_id", 3]]
---
<ul>
  <% @event.users.each do |user| %>