app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
def setup
  @user_id = session[:user_id]
  @logged_in = !!@user_id
  if @logged_in
    @current_user = User.find(@user_id)