app/controllers/login_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."user_name" = ? LIMIT ?  [["user_name", "emmanuel.satterfield"], ["LIMIT", 1]]
---
  def create
    @user = User.find_by(user_name: params[:user_name])