app/controllers/responses_controller.rb

  def create
    Response.create(event_id: params[:id], user_id: @current_user.id)
---
INSERT INTO "responses" ("user_id", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["event_id", 15], ["created_at", "2019-06-19 18:42:01.492970"], ["updated_at", "2019-06-19 18:42:01.492970"]]

  def destroy
    # byebug
    rsvp = Response.find_by(event_id: params[:id], user_id: @current_user.id)
    rsvp.destroy
---
SELECT  "responses".* FROM "responses" WHERE "responses"."event_id" = ? AND "responses"."user_id" = ? LIMIT ?  [["event_id", 1], ["user_id", 1], ["LIMIT", 1]]
DELETE FROM "responses" WHERE "responses"."id" = ?  [["id", 1]]