app/controllers/users_controller.rb

def create
 user = User.create(user_params)
---
INSERT INTO "users" ("name", "user_name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

def update
  @user.update(edit_user_params)
---
UPDATE "users" SET "bio" = ?, "pic_url" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["bio", "COOL BEANS\r\n"], ["pic_url", "https://qph.fs.quoracdn.net/main-qimg-c708da26713e970cd163c8a9ab63b203.webp"], ["updated_at", "2019-06-19 20:56:19.477976"], ["id", 17]]